tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"

# ----------------------------------- development -----------------------------------
cask "alacritty"
brew "ansible"
brew "bat"
cask "dbeaver-community"
cask "docker"
brew "eza"
brew "git"
cask "google-cloud-sdk"
brew "httpie"
brew "leoafarias/fvm/fvm"
cask "mockoon"
brew "mysql-client"
brew "n"
cask "postman"
brew "hashicorp/tap/terraform"
cask "visual-studio-code"
cask "zed"

# ----------------------------------- productivity -----------------------------------
cask "aldente"
cask "inkscape"
cask "notion"
cask "unnaturalscrollwheels"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "modern-csv"
cask "deepl"
cask "chatgpt"

# ----------------------------------- common app -----------------------------------
cask "vlc"
cask "slack"
cask "brave-browser"
cask "spotify"
cask "discord"
cask "nordvpn"
cask "folx"
cask "telegram"

# ----------------------------------- vscode-ext -----------------------------------
vscode "beardedbear.beardedicons"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "grapecity.gc-excelviewer"
vscode "intellsmi.comment-translate"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "openai.openai-chatgpt-adhoc"
vscode "teabyii.ayu"
vscode "vue.volar"